# PreferredJunctionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceManager..::..PreferredJunctionType Property
RoutingPreferenceManager Class See Also
---
The preferred junction type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PreferredJunctionType PreferredJunctionType { get; set; }
```

Visual Basic
---
```text
Public Property PreferredJunctionType As PreferredJunctionType
	Get
	Set
```

Visual C++
---
```text
public:
property PreferredJunctionType PreferredJunctionType {
	PreferredJunctionType get ();
	void set (PreferredJunctionType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace